In [3]:
from pandas import DataFrame

In [4]:
data = {'Estado':['Santa Catarina', 'Parana','Goias','Bahia','Minas Gerais'],
       'Ano':[2002,2003,2004,2005,2006],
       'Populacao':[1.5, 1.7, 3.6, 2.4, 2.9]}

In [5]:
frame = DataFrame(data)

In [6]:
frame

           Estado   Ano  Populacao
0  Santa Catarina  2002        1.5
1          Parana  2003        1.7
2           Goias  2004        3.6
3           Bahia  2005        2.4
4    Minas Gerais  2006        2.9

In [7]:
type(frame)

pandas.core.frame.DataFrame

In [8]:
#escolhe a sequencia que deseja que apareca
DataFrame(data, columns=['Ano','Estado','Populacao'])

    Ano          Estado  Populacao
0  2002  Santa Catarina        1.5
1  2003          Parana        1.7
2  2004           Goias        3.6
3  2005           Bahia        2.4
4  2006    Minas Gerais        2.9

In [9]:
#criando um dataframe com os mesmo dados que antes mas adicionando outra coluna
frame2 = DataFrame(data , columns=['Ano','Estado','Populacao','Debito'],
                  index = ['um','dois','tres','quatro','cinco'])

In [10]:
#imprimndo o frame2
frame2

         Ano          Estado  Populacao Debito
um      2002  Santa Catarina        1.5    NaN
dois    2003          Parana        1.7    NaN
tres    2004           Goias        3.6    NaN
quatro  2005           Bahia        2.4    NaN
cinco   2006    Minas Gerais        2.9    NaN

In [11]:
#ajustando coluan Debito
DataFrame(data, columns=['Ano','Estado','Populacao','Debito'])

    Ano          Estado  Populacao Debito
0  2002  Santa Catarina        1.5    NaN
1  2003          Parana        1.7    NaN
2  2004           Goias        3.6    NaN
3  2005           Bahia        2.4    NaN
4  2006    Minas Gerais        2.9    NaN

In [12]:
frame2.index

Index(['um', 'dois', 'tres', 'quatro', 'cinco'], dtype='object')

In [13]:
frame2.columns

Index(['Ano', 'Estado', 'Populacao', 'Debito'], dtype='object')

In [14]:
#Usando numpy e Pandas
import numpy as np

In [22]:
#usando o numpy para alimentar uma das colunas do dataFrame
frame2['Debito'] = np.arange(5)

In [18]:
frame2

         Ano          Estado  Populacao  Debito
um      2002  Santa Catarina        1.5     0.0
dois    2003          Parana        1.7     1.0
tres    2004           Goias        3.6     2.0
quatro  2005           Bahia        2.4     3.0
cinco   2006    Minas Gerais        2.9     4.0

In [24]:
frame2.values

array([[2002, 'Santa Catarina', 1.5, 0],
       [2003, 'Parana', 1.7, 1],
       [2004, 'Goias', 3.6, 2],
       [2005, 'Bahia', 2.4, 3],
       [2006, 'Minas Gerais', 2.9, 4]], dtype=object)

In [25]:
#resumo do Dataframe, resumo estatistico dos dados
frame2.describe()

               Ano  Populacao    Debito
count     5.000000   5.000000  5.000000
mean   2004.000000   2.420000  2.000000
std       1.581139   0.864292  1.581139
min    2002.000000   1.500000  0.000000
25%    2003.000000   1.700000  1.000000
50%    2004.000000   2.400000  2.000000
75%    2005.000000   2.900000  3.000000
max    2006.000000   3.600000  4.000000

In [26]:
#trazendo valores entre um perido nos dados
frame2['dois':'cinco']

         Ano        Estado  Populacao  Debito
dois    2003        Parana        1.7       1
tres    2004         Goias        3.6       2
quatro  2005         Bahia        2.4       3
cinco   2006  Minas Gerais        2.9       4

In [27]:
#verificar condicoes nos dados, transformando em valores booleanos
frame2 < 4

          Ano  Estado  Populacao  Debito
um      False    True       True    True
dois    False    True       True    True
tres    False    True       True    True
quatro  False    True       True    True
cinco   False    True       True   False

In [30]:
#localizando um registro dentro de um dataFrame pelo nome do indice
frame2.loc['tres']

Ano           2004
Estado       Goias
Populacao      3.6
Debito           2
Name: tres, dtype: object

In [31]:
#localizando dados pelo indice
frame2.iloc[2]

Ano           2004
Estado       Goias
Populacao      3.6
Debito           2
Name: tres, dtype: object

In [32]:
#invertendo as colunas de indices
#criando um dicionario
web_stats = {'Dias':[1,2,3,4,5,6,7],
            'Visitantes':[45, 23, 85, 96, 47, 85, 53],
            'Taxas':[11, 22, 33, 44, 55, 66, 77]}

In [33]:
df = DataFrame(web_stats)

In [34]:
print(df)

   Dias  Visitantes  Taxas
0     1          45     11
1     2          23     22
2     3          85     33
3     4          96     44
4     5          47     55
5     6          85     66
6     7          53     77

In [35]:
#visualizando a coluna e setando como index
print(df.set_index('Dias'))

      Visitantes  Taxas
Dias
1             45     11
2             23     22
3             85     33
4             96     44
5             47     55
6             85     66
7             53     77

In [37]:
#imprimindo as primeiras linhas do DataFrame
print(df.head())

   Dias  Visitantes  Taxas
0     1          45     11
1     2          23     22
2     3          85     33
3     4          96     44
4     5          47     55

In [39]:
#printando colunas especificas
print(df['Visitantes'])

0    45
1    23
2    85
3    96
4    47
5    85
6    53
Name: Visitantes, dtype: int64

In [41]:
print(df[['Visitantes','Taxas']])

   Visitantes  Taxas
0          45     11
1          23     22
2          85     33
3          96     44
4          47     55
5          85     66
6          53     77